Repository: frequency403/OpenSSH-GUI
Catalog: OpenSSH_GUI/StringsAndTexts.*.resx
Languages: de

# AddKeyWindowAbortButtonToolTipText
source: Abort
de: Abbruch

# AddKeyWindowAddKeyButtonToolTipText
source: Add SSH key
de: SSH-Schlüssel hinzufügen

# AddKeyWindowDefault
source: is default!
de: ist vorgegeben!

# AddKeyWindowKeyBitSizeComboBoxLabel
source: Bitsize
de: Bitgröße

# AddKeyWindowKeyCommentTextBoxLabel
source: Comment (email@example.com)
de: Kommentar (email@beispiel.de)

# AddKeyWindowKeyFileNameTextBoxLabel
source: Key filename
de: Schlüsseldateiname

# AddKeyWindowKeyKeyTypeComboBoxLabel
source: Keytype
de: Schlüsselart

# AddKeyWindowKeyPasswordTextBoxLabel
source: Password? (leave empty for none)
de: Passwort? (leer lassen für keins)

# AddKeyWindowTitle
source: Add new SSH key
de: Neuen SSH-Schlüssel hinzufügen

# ApplicationSettingsAutoConvertText
source: Convert ppk keys to openssh format automatically at start
de: PPK-Schlüssel beim Start automatisch in OpenSSH-Format konvertieren

# ApplicationSettingsDescription
source: Application Settings
de: Anwendungseinstellungen

# ApplicationSettingsMaxServers
source: Max count of servers to save
de: Maximale Anzahl gespeicherter Server

# ApplicationSettingsSavedServers
source: Saved Servers
de: Gespeicherte Server

# AuthorizedKeysAddKeyToFileOf
source: Add key to authorized_keys file of
de: Schlüssel zur authorized_keys-Datei hinzufügen von

# AuthorizedKeysFileContentFrom
source: File content from
de: Dateiinhalt von

# AuthorizedKeysFileContentLocal
source: File content from local machine
de: Dateiinhalt vom lokalen Rechner

source: Cancel and close
de: Abbrechen und schließen

# ConfirmDialogDefaultNoText
source: No
de: Nein

# ConfirmDialogDefaultOkText
source: Yes
de: Ja

# ConfirmDialogDefaultQuestionText
source: Allright?
de: Ok?

# ConnectToServerDescription
source: Connect to server
de: Mit Server verbinden

# ConnectWindowAcceptConnection
source: Accept connection
de: Verbindung akzeptieren

# ConnectWindowQuickConnect
source: Quick connect
de: Schnellverbindung

# ConnectWindowResetValues
source: Reset values
de: Werte zurücksetzen

# ConnectWindowTestConnection
source: Test connection
de: Verbindung testen

# ConnectWindowUseAllKeys
source: Use all keys
de: Alle Schlüssel verwenden

# ConnectWindowUsePubKey
source: Use public key
de: Öffentlichen Schlüssel verwenden

# EditKnownHostsWindowConfirmButtonToolTipText
source: Accept changes and write to file
de: Änderungen akzeptieren und in Datei schreiben

# EditKnownHostsWindowDataGridColumnHeaderFingerprintText
source: Fingerprint
de: Fingerabdruck

# EditKnownHostsWindowDataGridColumnHeaderKeySizeText
source: Keysize
de: Schlüsselgröße

# EditKnownHostsWindowDataGridColumnHeaderKeyTypeText
source: Keytype
de: Schlüsselart

# EditKnownHostsWindowDataGridColumnHeaderOptionsText
source: Options
de: Optionen

# EditKnownHostsWindowDismissButtonToolTipText
source: Dismiss and Close
de: Verwerfen und schließen

# EditKnownHostsWindowMarkForDeletionButtonToolTipText
source: Mark for deletion on save
de: Für Löschung beim Speichern markieren

# EditKnownHostsWindowReloadButtonToolTipText
source: Reload file and revert changes
de: Datei neu laden und Änderungen rückgängig machen

# EditKnownHostsWindowTitle
source: Edit known_hosts file
de: known_hosts-Datei bearbeiten

source: Error
de: Fehler

# ExportWindowCopyToClipboardToolTipText
source: Copy to clipboard
de: In Zwischenablage kopieren

# KeyFormatDescription
source: Key Format
de: Schlüsselformat

# MainWindowAddKeyToolTip
source: Add SSH key
de: SSH-Schlüssel hinzufügen

# MainWindowConnectionTooltipConnectedOn
source: Connected on:
de: Verbunden seit:

# MainWindowConnectionTooltipDisconnected
source: Currenty disconnected. Right click to open connection menu to establish a connection
de: Aktuell nicht verbunden. Rechtsklick, um das Verbindungsmenü zu öffnen und eine Verbindung herzustellen.

# MainWindowConnectionTooltipServerOs
source: Server OS:
de: Server-Betriebssystem:

# MainWindowConvertTooltip
source: Convert to opposite format
de: In entgegengesetztes Format konvertieren

# MainWindowDataGridColumnHeadingCommentText
source: Comment
de: Kommentar

# MainWindowDataGridColumnHeadingExportDeleteText
source: Export / Delete
de: Exportieren / Löschen

# MainWindowDataGridColumnHeadingFingerprintText
source: Fingerprint
de: Fingerabdruck

# MainWindowDataGridColumnHeadingKeySizeText
source: Keysize in bytes
de: Schlüsselgröße in Byte

# MainWindowDataGridColumnHeadingKeyTypeText
source: Keytype
de: Schlüsselart

# MainWindowDataGridControlsDeleteKeyToolTipText
source: Delete key from disk
de: Schlüssel von Festplatte entfernen

# MainWindowDataGridControlsExportPrivateKeyToolTipText
source: Export private key
de: Privatschlüssel exportieren

# MainWindowDataGridControlsExportPublicKeyToolTipText
source: Export public key
de: Öffentlichen Schlüssel exportieren

# MainWindowDataGridRowDetailsAbsolutePathText
source: Absolute path:
de: Absoluter Pfad:

# MainWindowDataGridRowDetailsFilenameText
source: Filename on disk:
de: Dateiname auf Festplatte:

# MainWindowDataGridRowDetailsPrivateKeyFilenameText
source: Private key filename:
de: Dateiname des Privatschlüssels:

# MainWindowEditAuthorizedKeys
source: Edit authorized_keys
de: authorized_keys bearbeiten

# MainWindowEditKnownHostsFileToolTip
source: Edit "known_hosts" file
de: "known_hosts"-Datei bearbeiten

# MainWindowFoundKeyPairsCountLabelPart2
source: keypairs in SSH directory
de: Schlüsselpaare im SSH-Verzeichnis gefunden

# MainWindowIsNotRemoteTooltipText
source: Connect to a server to edit the remote file!
de: Mit einem Server verbinden, um die Datei auf dem Server zu bearbeiten!

# MainWindowKeyFormatType
source: Key Format/Type:
de: Schlüsselformat/-art:

# MainWindowRightClickHelp
source: Right click for help
de: Rechtsklick für Hilfe

# MainWindowRightClickOptions
source: Right click for options
de: Rechtsklick für Optionen

# MainWindowViewModelDeleteKeyQuestionText
source: Really delete the SSH key?
de: SSH-Schlüssel wirklich löschen?

# MainWindowViewModelDeleteKeyTitleText
source: Delete {0}?
de: {0} löschen?

# MainWindowViewModelDynamicExportWindowTitle
source: Export {0} key: {1}
de: {0}-Schlüssel exportieren: {1}

# MainWindowViewModelExportKeyErrorMessage
source: Error exporting keyfile!
de: Fehler beim Exportieren der Schlüsseldatei

# MainWindowViewModelProblemLoadingFileText
source: Problem loading "{0}": {1}
de: Problem beim Laden von "{0}": {1}

# SaveAndClose
source: Save changes and close
de: Änderungen speichern und schließen

# MainWindowFoundKeyPairsCountLabelPart1
source: Found
de: Es wurden

# ErrorAction
source: Error {0}
de: Fehler {0}

# MainWindowConvertKeyMessageBoxTitle
source: {0}-key to a {1}-key
de: {0}-Schlüssel zu einem {1}-Schlüssel

# MainWindowConvertKeyMessageBoxText
source: This will convert your {0}. Do you want to delete the old file?
de: Hiermit wird ihr {0}. Möchten Sie den alten Schlüssel löschen?

# MainWindowConvertKeyMessageBoxErrorText
source: There was an error converting the keyfile. See the log for details.
de: Es trat ein problem beim Konvertieren auf. Konsultieren Sie die Log-Datei für mehr Informationen

# MainWindowDisconnectBoxTextNone
source: Nothing to disconnect from!
de: Keine Verbindung zum schließen!

# MainWindowDisconnectBoxTextSuccess
source: Disconnected successfully!
de: Verbindung erfolgreich geschlossen!

# MainWindowDisconnectBoxTitle
source: Disconnect from Server
de: Verbindung schließen

# MainWindowViewModelDeleteKeyQuestionTextPair
source: Really delete the SSH keypair?
de: SSH-Schlüsselpaar wiklich löschen?

# NotImplementedBoxText
source: This function is not implemented yet, but planned!
de: Diese Funktion ist noch nicht implementiert, aber geplant!

# NotImplementedBoxTitle
source: Not implemented yet
de: Noch nicht implementiert

# ApplicationSettingsEditErrorBoxText
source: You cannot edit a multi-key
de: Sie können keine Multi-Schlüssel Authentifizierung ändern!

# ApplicationSettingsEditErrorBoxTitle
source: Multi-key cannot be edited
de: Multi-Schlüssel Authentifizierung kann nicht editiert werden

# AddKeyWindowFilenameError
source: Filename does already exist!
de: Dateiname exisitert bereits!

# ConnectToServerStatusFailed
source: failed
de: Fehler

# ConnectToServerStatusSuccess
source: success
de: Erfolg

# ConnectToServerStatusUnknown
source: unknown
de: Unbekannt

# ConnectToServerValidationError
source: Missing hostname/ip, username or password!
de: Hostname/Ip, Nutzername oder Password fehlen!

# ConnectToServerStatusUntested
source: not yet tested
de: Nicht getestet

# ConnectToServerSshConnectionString
source: Connected to ssh://{0}@{1}
de: Verbunden mit ssh://{0}@{1}

# MainWindowConnectMenuConnect
source: Connect
de: Verbindung herstellen

# MainWindowConnectMenuDisconnect
source: Disconnect
de: Verbindung trennen

# MainWindowSettingsMenuAppSettings
source: Application settings
de: Anwendungseinstellungen

# MainWindowSettingsMenuLocalUserSshConfig
source: Local user ssh config
de: SSH-Konfiguration (Lokaler Nutzer)

# MainWindowSettingsMenuMachineSshdConfig
source: Machine sshd config
de: SSH-Konfiguration (PC)

# MainWindowSettingsMenuRemoteMachineSshdConfig
source: Remote user ssh config
de: SSH-Konfiguration (Server Nutzer)

# MainWindowSettingsMenuRemoteUserSshConfig
source: Remote machine sshd config
de: SSH-Konfiguration (Server)

# MainWindowHelpMenuAbout
source: About
de: Über OpenSSH-GUI

# MainWindowHelpMenuQuestion
source: Ask a question or for help
de: Frage stellen oder um Hilfe bitten

# MainWindowHelpMenuWebsite
source: Website/Manual
de: Website / Handbuch

# MainWindowSettingsMenuReloadKeysFromDisk
source: Reload keys from disk
de: Schlüssel neu von Festplatte laden

# MainWindowSettingsMenuReloadKeysFromDiskAndForgetPasswords
source: Reload keys and forget passwords
de: Schlüssel neu laden und Passwörter vergessen

# KeysShowPassword
source: Show password
de: Passwort anzeigen

# KeysForgetPassword
source: Forget password
de: Passwort vergessen

# KeysShowPasswordOf
source: Show password of {0}
de: Passwort für {0} anzeigen

# MainWindowViewModelProvidePasswordPromptHeading
source: Enter the password:
de: Passwort eingeben:

# MainWindowViewModelProvidePasswordPromptBodyHeading
source: Provide password for key {0}
de: Passwürt für {0} Schlüsseldatei bereitstellen

# MainWindowViewModelProvidePasswordPasswordLabel
source: Password:
de: Passwort:

# MainWindowViewModelProvidePasswordErrorHeading
source: Password incorrect!
de: Falsches Passwort!

# MainWindowViewModelProvidePasswordErrorContent
source: You provided a wrong password. Try {0} of {1}. Do you want to try again?
de: Sie haben ein falsches passwort eingegeben. Dies ist Versuch {0} von {1} möglichen Versuchen. Möchten sie es erneut versuchen?

# MainWindowViewModelProvidePasswordButtonAbort
source: Abort
de: Abbrechen

# MainWindowViewModelProvidePasswordButtonSubmit
source: Submit
de: Speichern
